
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.baz1.data.terraform_remote_state.org: Reading...
module.baz1.data.terraform_remote_state.org: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.baz1.github_actions_secret.secrets["APP_NAME"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "APP_NAME"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["APP_PROJECT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "APP_PROJECT_ID"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["BILLING_ACCOUNT"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "BILLING_ACCOUNT"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["CICD_PROJECT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "CICD_PROJECT_ID"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["FOLDER_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "FOLDER_ID"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["HOST_PROJECT_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "HOST_PROJECT_ID"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["ORG_ID"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "ORG_ID"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["SERVICE_ACCOUNT_EMAIL"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "SERVICE_ACCOUNT_EMAIL"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["TF_BACKEND"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "TF_BACKEND"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.secrets["WIF_PROVIDER_NAME"] will be created
  + resource "github_actions_secret" "secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "WIF_PROVIDER_NAME"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.source-secrets["APP_NAME"] will be created
  + resource "github_actions_secret" "source-secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "APP_NAME"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.source-secrets["CICD_PROJECT_ID"] will be created
  + resource "github_actions_secret" "source-secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "CICD_PROJECT_ID"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.source-secrets["GAR_LOCATION"] will be created
  + resource "github_actions_secret" "source-secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "GAR_LOCATION"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.source-secrets["GAR_REPO"] will be created
  + resource "github_actions_secret" "source-secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "GAR_REPO"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.source-secrets["SERVICE_ACCOUNT_EMAIL"] will be created
  + resource "github_actions_secret" "source-secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "SERVICE_ACCOUNT_EMAIL"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_actions_secret.source-secrets["WIF_PROVIDER_NAME"] will be created
  + resource "github_actions_secret" "source-secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = (known after apply)
      + secret_name     = "WIF_PROVIDER_NAME"
      + updated_at      = (known after apply)
    }

  # module.baz1.github_repository.app-infra will be created
  + resource "github_repository" "app-infra" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "baz1-infra"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
    }

  # module.baz1.github_repository.app-source will be created
  + resource "github_repository" "app-source" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "baz1-source"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "BLANK"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
    }

  # module.baz1.google_artifact_registry_repository.tf-image-repo will be created
  + resource "google_artifact_registry_repository" "tf-image-repo" {
      + create_time   = (known after apply)
      + description   = "Docker repository for baz1 images."
      + format        = "DOCKER"
      + id            = (known after apply)
      + location      = "us-central1"
      + name          = (known after apply)
      + project       = (known after apply)
      + repository_id = "baz1-images"
      + update_time   = (known after apply)
    }

  # module.baz1.google_artifact_registry_repository_iam_member.pull_images will be created
  + resource "google_artifact_registry_repository_iam_member" "pull_images" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = (known after apply)
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.baz1.google_artifact_registry_repository_iam_member.push_images will be created
  + resource "google_artifact_registry_repository_iam_member" "push_images" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = (known after apply)
      + project    = (known after apply)
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.baz1.google_project_iam_member.app-project will be created
  + resource "google_project_iam_member" "app-project" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/owner"
    }

  # module.baz1.google_project_iam_member.cicd-project will be created
  + resource "google_project_iam_member" "cicd-project" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/owner"
    }

  # module.baz1.google_project_service_identity.run_sa will be created
  + resource "google_project_service_identity" "run_sa" {
      + email   = (known after apply)
      + id      = (known after apply)
      + project = (known after apply)
      + service = "run.googleapis.com"
    }

  # module.baz1.google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id = "baz1-sa"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.baz1.google_storage_bucket.backend will be created
  + resource "google_storage_bucket" "backend" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "baz1-app-backend"
      + project                     = (known after apply)
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.baz1.module.gh_oidc.google_iam_workload_identity_pool.main will be created
  + resource "google_iam_workload_identity_pool" "main" {
      + description               = "Workload Identity Pool managed by Terraform"
      + disabled                  = false
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = (known after apply)
      + state                     = (known after apply)
      + workload_identity_pool_id = "baz1-pool"
    }

  # module.baz1.module.gh_oidc.google_iam_workload_identity_pool_provider.main will be created
  + resource "google_iam_workload_identity_pool_provider" "main" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.aud"        = "assertion.aud"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "Workload Identity Pool Provider managed by Terraform"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = (known after apply)
      + state                              = (known after apply)
      + workload_identity_pool_id          = "baz1-pool"
      + workload_identity_pool_provider_id = "baz1-gh-provider"

      + oidc {
          + allowed_audiences = []
          + issuer_uri        = "https://token.actions.githubusercontent.com"
        }
    }

  # module.baz1.module.gh_oidc.google_service_account_iam_member.wif-sa["baz1-sa"] will be created
  + resource "google_service_account_iam_member" "wif-sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.baz1.module.app-project.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.baz1.module.app-project.module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {
      + host_project    = "fs-vpc-host-dev-7703"
      + id              = (known after apply)
      + service_project = (known after apply)
    }

  # module.baz1.module.app-project.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01B29E-828C10-4D001A"
      + folder_id           = "778694630464"
      + id                  = (known after apply)
      + name                = "baz1-app-prj"
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.baz1.module.app-project.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.baz1.module.app-project.module.project-factory.google_project_iam_member.controlling_group_vpc_membership[0] will be created
  + resource "google_project_iam_member" "controlling_group_vpc_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fs-vpc-host-dev-7703"
      + role    = "roles/compute.networkUser"
    }

  # module.baz1.module.app-project.module.project-factory.google_project_iam_member.controlling_group_vpc_membership[1] will be created
  + resource "google_project_iam_member" "controlling_group_vpc_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fs-vpc-host-dev-7703"
      + role    = "roles/compute.networkUser"
    }

  # module.baz1.module.app-project.module.project-factory.google_project_iam_member.controlling_group_vpc_membership[2] will be created
  + resource "google_project_iam_member" "controlling_group_vpc_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fs-vpc-host-dev-7703"
      + role    = "roles/compute.networkUser"
    }

  # module.baz1.module.app-project.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = "baz1-app-prj Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.baz1.module.app-project.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.baz1.module.app-project.module.shared_vpc_access.google_project_iam_member.service_shared_vpc_user["vpcaccess.googleapis.com"] will be created
  + resource "google_project_iam_member" "service_shared_vpc_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fs-vpc-host-dev-7703"
      + role    = "roles/compute.networkUser"
    }

  # module.baz1.module.cicd-project.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.baz1.module.cicd-project.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01B29E-828C10-4D001A"
      + folder_id           = "778694630464"
      + id                  = (known after apply)
      + name                = "baz1-cicd-prj"
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.baz1.module.cicd-project.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.baz1.module.cicd-project.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + disabled     = false
      + display_name = "baz1-cicd-prj Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.baz1.module.cicd-project.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["admin.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "admin.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["cloudbilling.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudbilling.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["run.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "run.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "serviceusage.googleapis.com"
    }

  # module.baz1.module.app-project.module.project-factory.module.project_services.google_project_service.project_services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "vpcaccess.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["admin.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "admin.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["cloudbilling.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudbilling.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.baz1.module.cicd-project.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "serviceusage.googleapis.com"
    }

Plan: 61 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>